---
title: よくある質問
layout: post
description: null
image: null
nav-menu: true
---

<!-- Main -->
<div id="main">

<!-- One -->
<section id="one">
	<div class="inner">
		<dl>
            <dt>Q. プログラミング初心者どころかパソコンも初心者なのですが、入っても大丈夫でしょうか？</dt>
            <dd>A. 基本的に専用のソフトをインストールするだけで誰でもコンテンツ制作を始めることができます。初心者向けの講習会も随時行っています。</dd>
        </dl>
        <dl>
            <dt>Q. 総コンのゲーム制作分野に興味がありますが、プログラミングは初心者です。入部は可能でしょうか？</dt>
            <dd>A. 能力に関係なく入会していただけます。初心者の1年生でも、明大祭等でゲームを制作して展示する人もいます。どの班も年間通して初心者向けの講習会を開いているのに加え、Slackというサービスを用いた質問対応も随時受け付けています。</dd>
        </dl>
        <dl>
            <dt>Q. 活動中自分のパソコンないと厳しいですか？</dt>
            <dd>A. 現サークルメンバーは持っている人がほとんどですが、（サークルメンバーの殆どを占める総合数理学部のカリキュラム自体が自前のPC必須のため）活動していくうえで必ず必要というわけではありません。例えばiPad上で動くDAWソフトや、スマホで使えるペイントツールなどを使うこともできます。どんな活動がしたいかにより必要性は異なりますので、体験会やメール、Twitter等でお問い合わせください。</dd>
        </dl>
        <dl>
            <dt>Q. 入会の仕方を教えてください。</dt>
            <dd>A. 入会フォームに必要事項を記入していただき、入会費、年会費をいただくことで入会していただけます。サークルのメールアドレス、またはTwitterにてご連絡ください。※明治大学外からの入会は受け付けておりません。</dd>
        </dl>
        <dl>
            <dt>Q. 1年生ではなくても入会できますか？</dt>
            <dd>A. 可能です。どの学年からの入会も受け付けています。</dd>
        </dl>
        <dl>
            <dt>Q. 体験後やコンパ後に班を移ったり減らしたりすることはできますか？</dt>
            <dd>A. 所属班はいつでも変更することができます！最低1つの班には所属していただくようお願いします。</dd>
        </dl>
        <dl>
            <dt>Q. サークルでの活動は個人製作ですか、グループ制作ですか？</dt>
            <dd>A. 基本的には個人製作をメインとしていますが、明大祭の展示ではグループ制作を行っています。</dd>
        </dl>
        <dl>
            <dt>Q. 女性のメンバーもいますか？</dt>
            <dd>A. どの班・学年にも複数名の女性メンバーがいます。サークル全体での男女比は7：3程度です。</dd>
        </dl>
        <dl>
            <dt>Q. サークル全体と各班のそれぞれの人数はどれぐらいですか？</dt>
            <dd>A. 全体では100人程度が所属しています。2020年7月現在、イラスト班は40人、音楽班は49人、映像班は30人、ゲーム班は63人が所属しています(重複あり)。</dd>
        </dl>
        <dl>
            <dt>Q. イラスト班は模写を描くだけでもできますか？</dt>
            <dd>A. 可能です。もし、オリジナルの構図やキャラクターを描けるようになりたいのであれば、講習や情報共有によってサポートすることもできます。</dd>
        </dl>
        <dl>
            <dt>Q. プログラミング班はゲームを制作するときにどの言語を主に使っていますか？</dt>
            <dd>A. 多くの人がUnity(C#)を使っています。</dd>
        </dl>
        <dl>
            <dt>Q. ゲーム班では、ギャルゲーの制作などはできますか？</dt>
            <dd>A. 可能です。過去の所属メンバーには、ギャルゲーを自主製作し即売会等で頒布していた方もいらっしゃいます。</dd>
        </dl>
        <dl>
            <dt>Q. 有償でサークルPVなどを作っていただくことは可能でしょうか？</dt>
            <dd>A. サークルの規約とも関わってくるので、詳しくはTwitter、またはメールにてお問合せ下さい。</dd>
        </dl>
        <br>
        <ul class="actions">
            <li><a href="7-contact.html" class="button">お問い合わせはこちら</a></li>
        </ul>
	</div>
</section>